x-Roy-x/Goal/SmartBoy.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LCD.h"
#include "ADC_SENSOR_1.h"
#include "ADC_SENSOR_1_aliases.h"
#include "ADC.h"
#include "Debouncer_Clock.h"
#include "Button_Scan.h"
#include "Button_Scan_aliases.h"
#include "Button_Scan_Int.h"
#include "Button_Reset.h"
#include "Button_Reset_aliases.h"
#include "Button_Reset_Int.h"
#include "Clock_1.h"
#include "BLE_gatt.h"
#include "BLE.h"
#include "BLE_HAL_PVT.h"
#include "BLE_STACK_PVT.h"
#include "BLE_StackGap.h"
#include "BLE_StackGatt.h"
#include "BLE_StackGattDb.h"
#include "BLE_StackHostMain.h"
#include "BLE_StackL2cap.h"
#include "BLE_StackGattServer.h"
#include "BLE_StackGattClient.h"
#include "BLE_Stack.h"
#include "BLE_eventHandler.h"
#include "BLE_custom.h"
#include "Timer_Int.h"
#include "Timer.h"
#include "Status_LED_Red.h"
#include "Status_LED_Red_aliases.h"
#include "Timer_Update.h"
#include "Clock_2.h"
#include "Timer_Update_Int.h"
#include "ADC_SENSOR_2.h"
#include "ADC_SENSOR_2_aliases.h"
#include "Status_LED_Green.h"
#include "Status_LED_Green_aliases.h"
#include "Status_LED_Blue.h"
#include "Status_LED_Blue_aliases.h"
#include "LCD_LCDPort.h"
#include "LCD_LCDPort_aliases.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "BLE_bless_isr.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

